Revit 2027 API
ParameterTypeId.BoundaryRestraintRotZ Property
 "Z Rotation Spring Modulus"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId BoundaryRestraintRotZ { get; }
Public Shared ReadOnly Property BoundaryRestraintRotZ As ForgeTypeId
	Get
public:
static property ForgeTypeId^ BoundaryRestraintRotZ {
	ForgeTypeId^ get ();
}
static member BoundaryRestraintRotZ : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace